IDENTIFICATION DIVISION.
PROGRAM-ID. AddThreeVars.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X  PIC 9(3) VALUE 50.
01 Y  PIC 9(3) VALUE 50.
01 Z  PIC 9(3) VALUE 50.
01 SUM-TOTAL PIC 9(4) VALUE 0.

PROCEDURE DIVISION.
MAIN-LOGIC.
    COMPUTE SUM-TOTAL = X + Y + Z.
    DISPLAY SUM-TOTAL.
    STOP RUN.  